import React, { useState } from "react";
import { render } from "react-dom";
import {
  StyleSheet,
  Text,
  View,
  Button,
  ScrollView,
  FlatList,
} from "react-native";
import { globalstyles } from "../styles/global";
function Home05() {
  const [people] = useState([
    { name: "1. قسم النشاط الرياضي.", key: "1" },
    { name: "2.قسم النشاط الثقافي والاجتماعي والفني.", key: "2" },
    { name: "3.قسم الخدمات الصحية.", key: "3" },
    { name: "4.قسم الإرشاد النفسي والإجتماعي.", key: "4" },
    { name: "5. وحدة الخدمات الطلابية.", key: "5" },
  ]);
  const [people1] = useState([
    {
      name:
        "•الإشراف على سير العمل في مختلف أقسام العمادة، ويضع مع رؤساء الأقسام الخطط و ا لتو جيهات .",
      key: "1",
    },
    {
      name:
        "•توزيع ما يرد من أنظمة وتعليمات و توجيهات صادرة عن رئاسة الجامعة الى أقسام العمادة ومجلس اتحادالطلبة",
      key: "2",
    },
    { name: "• تنسيق مراجعات الطلبة مع العمادةو أقسامها.", key: "3" },
    {
      name:
        "•تصوير النماذج والرسائل والكتب المتعلقة بالعمادة ومجلس اتحادالطلبة مع ضبط الصادر والوارد. ",
      key: "4",
    },
    {
      name:
        "•تقديم المساعدات والحوافز المادية,الطلبة من خال صندوق الإقراض،و منح المتفوقين وذوي الشهداء،و متابعة قضايا الطلبة المعتقلين.",
      key: "5",
    },
    {
      name:
        "•تشجيع الطلبة الموهوبين في المجالات كافة، لإطاق إبداعاتهم و تطوير هواياتهم.  ",
      key: "6",
    },
    { name: "•تقديم الرعاية الصحية للطلبة.", key: "7" },
    { name: "•الإشراف على انتخابات مجلس الطلبة.", key: "8" },
  ]);
  const [people2] = useState([
    {
      name:
        ".1 تنظيم التدريبات لإعداد الفرق الرياضية في كافة الألعاب الرياضية للذكور والإناث .",
      key: "1",
    },
    {
      name:
        ".2 تنظيم اللقاءات والمباريات بين فرق الجامعة والفرق الرياضية خارج الجامعة، ومع الجامعات الفلسطينية محلياً وعربياً، وتقديم الحوافز المادية والمعنوية للطلبة.",
      key: "2",
    },
    {
      name:
        ".3 وضع البرامج الرياضية لتنمية مواهب الطلبة وهواياتهم، وتوسيع القاعدة الرياضية الطلابية خاصة بين الإناث.",
      key: "3",
    },
    {
      name:
        ".4 الإشراف على المرافق الرياضية، وتنظيم عملية استخدامها، والإفادة من الأدوات والأجهزة فيها ) الملاعب الرياضية المكشوفة في مواقع الجامعة، والقاعات الرياضية المغلقة(. ",
      key: "4",
    },
    {
      name:
        ".5 تنظيم مباريات دورية متنوعة بين الأقسام والكليات داخل الجامعة للعاملين والطلبة.",
      key: "5",
    },
    {
      name:
        ".6 المشاركة في أنشطة وفعاليات الاتحاد الرياضي للجامعات الفلسطينية،علماً أن رئيس قسم النشاط الرياضي هو رئيس الاتحاد الفلسطيني للعام 2018 / 2019 .  ",
      key: "6",
    },
  ]);
  const [people3] = useState([
    {
      name:
        ".1 الإشراف على أماكن الصاة للطلبة في كافة مواقع الجامعة، وعددها 5 مصليات.",
      key: "1",
    },
    {
      name: ".2 تنفيذ العديد من الأنشطة التطوعية داخل الجامعة وخارجها.",
      key: "2",
    },
  ]);
  const [people4] = useState([
    {
      name:
        ".1 إجراء مسابقات ثقافية بين كليات الجامعة وتكريم الفائزين بجوائز نقدية.",
      key: "1",
    },
    {
      name: ".2 إحياء الحفلات، وإقامة المعارض، والمهرجانات والأمسيات الفنية.",
      key: "2",
    },
    {
      name:
        '.3 نشر إنتاج الطلبة الفكري والفني في مطبوعات خاصة بالجامعة "مجلة إبداع".',
      key: "3",
    },
    {
      name:
        ".4 الإشراف على فرقة مسرح الجامعة، من تدريبات وعروض محلية وخارجية. ",
      key: "4",
    },
    {
      name:
        '.5 الإشراف على فرقة الفنون الشعبية "الكورال، الدبكة" من خال التدريب والمشاركة في العروض المحلية والخارجية.',
      key: "5",
    },
    {
      name:
        ".6 المشاركة في مسابقات فن المناظرة بين الجامعات الفلسطينية والعربية. ",
      key: "6",
    },
  ]);
  const [people5] = useState([
    {
      name:
        "•لقاءات إرشادية مع الطلبة الجدد سنويا لتسهيل عملية اندماجهم، وتحقيق عملية التكيف الاجتماعي .",
      key: "1",
    },
    {
      name:
        "•لقاءات وورشات عمل وحلقات نقاش في موضوعات تسلط الضوء على احتياجات الشباب ومشكلاتهم السلوكية والمعرفية.",
      key: "2",
    },
  ]);
  const [people6] = useState([
    { name: "•إصدار شهادات حسن السلوك .", key: "1" },
    { name: "•إصدار تقارير اجتماعية لبعض الطلبة المعسرين ماليا .", key: "2" },
    {
      name:
        "•الإشراف على إدارة الجمعيات العلمية والمجموعات الطلابية في الكليات وعددها 20 جمعية .",
      key: "3",
    },
    {
      name:
        "•المشاركة سنويا في عضوية لجنة التخريج، والإشراف على فعاليات حفات التخريج.",
      key: "4",
    },
    {
      name: "•توفير مقرات تصوير وطباعة للكتل الطلابية والإشراف على أدائها.",
      key: "5",
    },
    {
      name:
        "•إدارة قاعة الانشطة اللامنهجية، وفعالياتها : لقاءات واجتماعات الكتل الطلابية ،اجتماعات عامة للعمادة ، استقبال وفود .. الخ(",
      key: "6",
    },
    {
      name:
        "•مشاركة كلية التربية في استخدام قاعة المسرح التعليمي لعروض مسرحية.",
      key: "7",
    },
    {
      name:
        "•الإشراف على الملتقى الأدبي وأهم فعالياته: إلقاء الشعر والنثر، وكتابة القصة القصيرة، و نقاش الروايات وغير ذلك.",
      key: "8",
    },
    {
      name:
        "•الإشراف على فعاليات ملتقي القرآن الكريم بالتعاون مع كلية الشريعة .",
      key: "9",
    },
    {
      name:
        "•المشاركة في عملية تسجيل الطلبة الجدد، وتقديم الإرشاد المهني لمساعدتهم  في اختيار التخصص.",
      key: "10",
    },
  ]);
  const [people7] = useState([
    {
      name:
        "•تسهيل إجراءات الرحات العلمية بالتنسيق مع الدوائر الإدارية في الجامعة وجهات المواصات من المجتمع المحلي.",
      key: "1",
    },
    {
      name: "•إصدار براءة الذمة للطلبة الخريجين أو المنسحبين من الجامعة .",
      key: "2",
    },
    {
      name: "•متابعة منح أسر الشهداء، بالتنسيق مع الدائرة المالية .",
      key: "3",
    },
    {
      name:
        "•متابعة تسليم قرارات لجان الضبط ولجان الاستئناف بحق الطلبة، بالتنسيق مع مكتب الرئيس.",
      key: "4",
    },
    {
      name: "•متابعة إجراءات تسجيل الطلبة المفرج عنهم من المعتقلات .",
      key: "5",
    },
    {
      name:
        "•الإشراف على إدارة زاوية الكتب المستعملة، بالتنسيق مع طلبة متطوعين .",
      key: "6",
    },
  ]);

  return (
    <View style={globalstyles.container}>
      <ScrollView>
        <View style={globalstyles.header}>
          <Text style={globalstyles.body}>Deanship of Student Affairs</Text>
        </View>
        <Text style={globalstyles.body3}>نبذة عن العمادة :</Text>
        <Text style={globalstyles.body2}>
          تعدّ عمادة شؤون الطلبة من أبرز عمادات الجامعة، فهي ترعى الطلبة و تشرف
          على أنشطتهم المتنوعة وتؤدي دوراً فعالاً في تنمية شخصية الطالب، وتعوده
          على تحمل المسؤولية,كي يصبح فعالاً في مجتمعه،
        </Text>
        <Text style={globalstyles.body3}>و يقوم مكتب العمادة بما يأتي :</Text>
        <FlatList
          nestedScrollEnabled
          data={people1}
          renderItem={({ item }) => (
            <Text style={globalstyles.body4}>{item.name}</Text>
          )}
        />
        <Text style={globalstyles.body3}>أقسام عمادة شؤون الطلبة :</Text>
        <FlatList
          numColumns="2"
          data={people}
          renderItem={({ item }) => (
            <Text style={globalstyles.body4}>{item.name}</Text>
          )}
        />
        <Text style={globalstyles.body3}>
          الأنشطة المتنوعة لعمادة شؤون الطلبة :
        </Text>
        <Text style={globalstyles.body5}>قسم النشاط الرياضي</Text>
        <Text style={globalstyles.body2}>
          تعدّ عمادة شؤون الطلبة من أبرز عمادات الجامعة، فهي ترعى الطلبة و تشرف
          على أنشطتهم المتنوعة وتؤدي دوراً فعالاً في تنمية شخصية الطالب، وتعوده
          على تحمل المسؤولية,كي يصبح فعالاً في مجتمعه،
        </Text>
        أهم فعاليات قسم النشاط الرياضي:
        <FlatList
          data={people2}
          renderItem={({ item }) => (
            <Text style={globalstyles.body4}>{item.name}</Text>
          )}
        />
        <Text style={globalstyles.body3}>
          قسم الأنشطة الثقافية و الفنية و المجتمعية :
        </Text>
        <Text style={globalstyles.body5}>النشاط المجتمعي :</Text>
        <Text style={globalstyles.body2}>
          تهتم العمادة بتشجيع النشاط الاجتماعي وتنظيمه، والإشراف عليه،ويتضمن هذا
          النشاط ما يلي:
        </Text>
        <FlatList
          data={people3}
          renderItem={({ item }) => (
            <Text style={globalstyles.body4}>{item.name}</Text>
          )}
        />
        <Text style={globalstyles.body5}>النشاط الثقافي و الفني :</Text>
        <Text style={globalstyles.body2}>
          تتولى العمادة تشجيع النشاطات الثقافية والفنية التي من شأنها رفع درجات
          الوعي الوطني والثقافي والترويحي، وذلك عن طريق النشاطات الأتية:
        </Text>
        <FlatList
          data={people4}
          renderItem={({ item }) => (
            <Text style={globalstyles.body4}>{item.name}</Text>
          )}
        />
        <Text style={globalstyles.body5}>قسم الأرشاد النفسي - الأجتماعي:</Text>
        <Text style={globalstyles.body2}>
          تهدف عمادة شؤون الطلبة الى رفع مستوى الصحه النفسية والاجتماعية للطلبة
          والعاملين والإسهام في بناء شخصياتهم وصقلها وإمدادها بالمعرفة والوعي
          والثقافة والاتزان والرضا النفسي والاجتماعي، ولتحقيق هذه الغاية يقوم
          قسم الإرشاد بتنفيذ مجموعة من المهام والمسؤوليات على مستويات متعددة،
          ومنها :
        </Text>
        <Text style={globalstyles.body6}>المستوى الوقائي: من خلال:</Text>
        <FlatList
          data={people5}
          renderItem={({ item }) => (
            <Text style={globalstyles.body4}>{item.name}</Text>
          )}
        />
        <Text style={globalstyles.body6}>المستوى العلاجي :</Text>
        <Text style={globalstyles.body2}>
          ويكون من خال تقديم خدمات الإرشاد الفردي والجمعي في إطار مهني، لمساعدة
          الطلبة الذين يواجهون صعوبات في التغلب على مشكلاتهم الاقتصادية
          والاجتماعية والنفسية والعائلية، والتي قد تؤثر سلبا على إنجازهم
          الأكاديمي. وقد يتطلب تنفيذ هذه المهمات التنسيق مع جهات أخرى، أكاديمية
          أو إدارية داخل الجامعة ، أو جهات ومؤسسات مهنية محلية بهدف تكامل
          الخدمة، ومن خال نظام التحويل، وبخاصة مع العيادات النفسية في وزارة
          الصحة الفلسطينية، والتنسيق مع بعض الجهات المحلية في القطاع الخاص
          لتشغيل الطلبة ، إضافة إلى رعاية برنامج تشغيل الطلبة في مرافق الجامعة
          حسب الإمكانات المتاحة .
        </Text>
        <Text style={globalstyles.body6}>المستوى النمائي :</Text>
        <Text style={globalstyles.body2}>
          يهتم قسم الإرشاد بتنظيم الدورات واللقاءات التدريبية التي تسهم في صقل
          مهارات الطلبة وقدراتهم، وتفجير إبداعاتهم ومبادراتهم، بما يخدم الفرد
          والمجتمع، فضاً عن اهتمامه برعاية الأنشطة التي تساعد في خلق روح الجماعة
          والتعاون، والمواطنة الفاعلة مثل اللقاءات الترفيهية والتفريغية التي
          تعتمد على الورش والدورات والندوات التي تسهم في صقل الطلبة ومساعدتهم في
          اتخاذ القرار، ونتمية قدراتهم ومهاراتهم.
        </Text>
        <Text style={globalstyles.body3}>خدمات عامة :</Text>
        <Text style={globalstyles.body2}>
          لتحقيق رسالتها تقوم عمادة شؤون الطلبة بمجموعة من الخدمات المتنوعة،
          ،ومنها:
        </Text>
        <FlatList
          data={people6}
          renderItem={({ item }) => (
            <Text style={globalstyles.body4}>{item.name}</Text>
          )}
        />
        <Text style={globalstyles.body3}>الكافتيريات داخل الجامعة :</Text>
        <Text style={globalstyles.body2}>
          بالتعاون مع مجلس الطلبة وممثل عن إدارة الجامعة تقوم العمادة بالإشراف
          على طبيعة الخدمات في الكافتيريات، بما يشمل تحقيق الشروط الصحية في
          الوجبات، ومراقبة الأسعار، وذلك بهدف تقديم خدمات عالية الجودة للطلبة .
        </Text>
        <Text style={globalstyles.body3}>صندوق الطلبة:</Text>
        <Text style={globalstyles.body2}>
          تقوم العمادة من خال صندوق الطلبة بتقديم المساعدة المالية للطلبة
          المحتاجين، سواء بالقروض، أو المنح المالية، بالتنسيق مع وحدة القروض
          المالية في وزارة التعليم العالي، والدائرة المالية في الجامعة، إلى جانب
          توفير فرص عمل للطلبة داخل الجامعة وخارجها، ضمن الإمكانات والمجالات
          المتوفرة ) مثل التنسيق مع مؤسسة ريتش للاتصالات( بالإضافة الى توفير فرص
          عمل للطلبة المحتاجين داخل مكتبات الجامعة، وتقديم حوافز مالية.
        </Text>
        <Text style={globalstyles.body3}>
          وحدة الخدمات الطلابية (One Stop Shop):
        </Text>
        <Text style={globalstyles.body2}>
          تم إنشاء وحدة الخدمات الطلابية في العام 2014 بهدف تسهيل تقديم أيّة
          خدمة يحتاجها الطلبة إداريا وأكاديميا ، وماليا حيث تتنوع فيها
          المسؤوليات والمهام على النحو الآتي :
        </Text>
        <FlatList
          data={people7}
          renderItem={({ item }) => (
            <Text style={globalstyles.body4}>{item.name}</Text>
          )}
        />
        <Text style={globalstyles.body3}>الرعاية الصحية للطلبة:</Text>
        <Text style={globalstyles.body2}>
          تقدّم الخدمات الصحية الأولية والطارئة في عيادات الجامعة، وعددها 4
          عيادات ، باشراف طاقم أطباء وممرضات ، ويتم تحويل الحالات الصعبة إلى
          مستشفى النجاح التعليمي . بالإضافة إلى تقديم خدمة التأمين الصحي لجميع
          الطلبة في مستشفى النجاح التعليمي .
        </Text>
      </ScrollView>
    </View>
  );
}

export default Home05;
