import React from "react";
import { render } from "react-dom";
import { StyleSheet, Text, View, ScrollView } from "react-native";
import { globalstyles } from "../styles/global";
function Home07() {
  return (
    <View style={globalstyles.container}>
      <View style={globalstyles.header}>
        <Text style={globalstyles.body}>
          Deanship of Admission and Regstration
        </Text>
      </View>
      <ScrollView style={globalstyles.scroll}>
        <Text style={globalstyles.body2}>
          تبدأ العلاقة بين الطالب والجامعة بعمادة القبول والتسجيل إذ يحصل منها
          على طلب الالتحاق لتعبئته وإعادته، وتنتهي أيضاً بعمادة القبول والتسجيل
          حيث منها يحصل بعد تخرجه على وثائق التخرج، وعليه فإن العلاقة دائمة بين
          الطالب والعمادة طيلة فترة دراسته، فالعمادة تزود الطالب بشهادة إثبات
          طالب لاستعمالها لجميع الأغراض، وبكشف علاماته عند الطلب، أو خطته
          الدراسية، وفيها يقدم طلب الانتقال من برنامج إلى آخر وهكذا، وكما أن
          العلاقة دائمة، فهي أيضا متجددة إذ إن على عمادة القبول والتسجيل إعام
          الطلبة بكل ما يستجد من أمور تتعلق بالنواحي الأكاديمية، كالتغيير في
          الخطة الدراسية، أو التغيير في تعليمات منح درجة البكالوريوس.
        </Text>
        <Text style={globalstyles.body2}>
          وخطت العمادة خطوة رائدة في حوسبة الإجراءات والمعامات لتسهيل التواصل
          على الطلبة والكليات والدوائر ، مثل )براءة الذمة ، التأجيل، ومراجعة
          علامة مساق، والانسحاب ، ودفع الرسوم . . . الخ، وتأمل العمادة الاستمرار
          في حوسبة كافة الإجراءات وصولاً الى الحوسبة الكاملة توفيراً للوقت
          والجهد، وهنا ننصح الطالب بالتعرف على الخدمات الإلكترونية المتوفرة على
          زاجله، واستخدامها في التواصل مع عمادة القبول والتسجيل. وبذلك تظهر
          أهمية عمادة القبول والتسجيل لدوام ارتباط الطالب بها طيلة سني دراسته،
          وبعد التخرج من خال الاحتفاظ بسجله حيث توفر له خدمة ما بعد التخرج.
        </Text>
        <Text style={globalstyles.body2}>
          وتسعى عمادة القبول ضمن سياسة التطوير المؤسسي إلى تطوير أعمالها في
          مجموعة من المحاور، والتي من شأنها أن تقلل الجهد والوقت والتكلفة على
          الطالب والجامعة بشكل عام.
        </Text>
        <Text style={globalstyles.body3}>:أهداف العمادةوأعمالها</Text>
        <Text style={globalstyles.body2}>
          تهدف العمادة إلى تطبيق الأنظمة الأكاديمية المعمول بها والمقررة. ولهذا
          الغرض تستخدم السجلات والكشوف التي تبين وضع الطالب الأكاديمي منذ
          التحاقه بالجامعة حتى تخرجه منها. وتضع بالتعاون مع اللجان المتخصصة
          التعليمات والإجراءات الخاصة بالتسجيل للفصول المختلفة، كما تعلن برنامج
          الدراسة.
        </Text>
        <Text style={globalstyles.body2}>
          ولما كانت عمادة القبول والتسجيل هي مجمع علامات الطلبة، فإنها تقوم
          بإباغ الطالب المقصر عن طريق برنامج الزاجل بأنه تحت الإنذار الأكاديمي،
          كما أنها تبلغ العمداء بأسماء الطلبة الذين ستعلن أسماؤهم على لوحة
          الشرف، وكذلك فهي تشارك في اللجان الداخلية.
        </Text>
        <Text style={globalstyles.body2}>
          ولما كانت جامعة النجاح الوطنية جامعة ناشئة ومتطورة فان عمادة القبول
          والتسجيل تسعى إلى تطوير إجراءات العمل فيها وحوسبة، تلك الإجراءات،
          وزيادة الخبرات، من خال زيارة الجامعات الأخرى والاشتراك بجمعيات التسجيل
          العالمية، وحضور مؤتمرات لمسؤولي القبول والتسجيل في الجامعات العربية
          لتبادل الخبرات في مجالات القبول والتسجيل.
        </Text>
        <Text style={globalstyles.body3}>إجراءات القبول</Text>
        <Text style={globalstyles.body2}>
          بعد انتهاء امتحان الثانوية العامة تعلن عمادة القبول والتسجيل عن فتح
          باب تقديم طلبات الالتحاق بالجامعة لطلبة الثانوية العامة الناجحين من
          جميع أنحاء فلسطين، سواء أكان ذلك بالحضور إلى الحرم الجامعي، أم من خال
          موقع الجامعة على الإنترنت )زاجل( باتباع الإرشادات الخاصة بذلك.
        </Text>
        <Text style={globalstyles.body2}>
          إن أساس قبول الطالب بجامعة النجاح الوطنية هو معدله في امتحان الثانوية
          العامة الذي يجب ألا يقل عن 90 ٪ لبرنامج دكتور في الطب، و 85 ٪ لبرامج
          الصيدلة، ٪80 لبرامج الهندسة وبرنامج البصريات، و 75 ٪ لبرنامج الطب
          البيطري وبرنامج العلوم الطبية المخبرية وبرنامج علم السمع والنطق
          وبرنامج العاج الطبيعي وبرنامج تكنولوجيا التروية القلبية وبرنامج
          القانون، و 70 ٪ لبرامج القباله وبرنامج التمريض، والإعام وتكنولوجيا
          المعلومات وبرنامج التصوير الطبي، و 65 ٪ لباقي البرامج، أما برامج
          التربية الرياضية - كلية التربية وإعداد المعلمين وبرامج كلية الفنون
          الجميلة فيتم القبول فيهما بشرطين، هما معدل الثانوية العامة 65 ٪ فأعلى،
          واجتياز امتحان قدرات لكل منهما، وألا يكون قد مر على حصوله على شهادة
          الدراسة الثانوية العامة أكثر من خمس سنوات لجميع الكليات، باستثناء كلية
          الفنون الجميلة. وبعد تحديد المعدلات المقبولة في كل برنامج يتم الإعان
          في الصحف المحلية عن مواعيد استكمال إجراءات القبول.
        </Text>
        <Text style={globalstyles.body2}>
          ويشترط تقديم كشف علامات أصلي أو صورة مصدقة، وكذلك شهادة مياد أصلية أو
          صورة مصدقة، وصورة عن الهوية الشخصية، ودفع رسم الالتحاق المقرر، وبعد
          تقديم هذه الوثائق ودفع القسط يكون الطالب قد أصبح ملتحقاً بالجامعة،
          ويحصل على رقم تسجيل وبطاقة الهوية الجامعية.
        </Text>
        <Text style={globalstyles.body3}>إجراءات التسجيل</Text>
        <Text style={globalstyles.body2}>
          يتم تسجيل المساقات التي سيدرسها الطالب في الفصل بوساطة الحاسوب بعد أن
          يكون قد اتفق مع المرشد على تلك المساقات.
        </Text>
      </ScrollView>
    </View>
  );
}
export default Home07;
