import React from "react";
import { render } from "react-dom";
import { StyleSheet, Text, View, ScrollView } from "react-native";
import { globalstyles } from "../styles/global";
function Home06() {
  return (
    <View style={globalstyles.container}>
      <View style={globalstyles.header}>
        <Text style={globalstyles.body}>The library</Text>
      </View>
      <ScrollView style={globalstyles.scroll}>
        <Text style={globalstyles.body2}>
          توفّر الجامعة مكتبة رئيسية مركزية تتبعها أربع مكتبات فرعية تقدّم
          خدماتها لروادها من أساتذة وطلبة وباحثين، وقد توسعت مكتبات الجامعة في
          الآونة الأخيرة بعد إنجاز مبنى مكتبة الحرم الجديد ومكتبة المشفى
          الجامعي، لتضيف نقلة نوعية متميزة في خدماتها نظراً لزيادة عدد الطلبة
          ورواد المكتبة.
        </Text>
        <Text style={globalstyles.body2}>
          وتحتوي مكتبات الجامعة على ما يقارب 567 ألف مجلد تقليدي وكتاب إلكتروني،
          و 78 ألف دورية إلكترونية متخصصة، ومجموعة متميزة من مكتبات الأدباء
          والعلماء، وكتبٍ نادرة تم التبرع بها لمكتبات الجامعة وتحوي مجموعة من
          المخطوطات والوثائق التي تم رقمنتها ونشرها على صفحة الجامعة الإلكترونية
          وتقديمها للباحثين والمحققين، للحفاظ على الإرث الحضاري الوطني.
        </Text>
        <Text style={globalstyles.body2}>
          ونظرا للتطورات الهائلة في تكنولوجيا المعلومات والانترنت والاتصالات
          التي دخلت المكتبات ومراكز المعلومات، فقد وفرت مكتبات الجامعة الخدمة
          الإلكترونية، وتم ربط الجامعة ومكتباتها بعشرات قواعد المعلومات على الخط
          المباشر، وفتحها للرواد عن بعد، باستخدام تقنية البحث عبر الإنترنت التي
          توفر الأبحاث والمقالات كاملة النص ،إلى جانب الاشتراك بآلاف الكتب
          الإلكترونية.
        </Text>
        <Text style={globalstyles.body2}>
          وتستخدم المكتبة نظام ديوي العشري المعدل في نظام التصنيف، ونظام الفهرسة
          المقروءة آليا MARK21 العالمية، ويعمل في أقسام المكتبات المتنوعة من
          إعارة، ومراجع، ودوريات، وإرشاد، ومصادر إلكترونية، مجموعة من الموظفين
          المؤهلين الذين تم تدريبهم لإيصال المعلومة الصحيحة في الوقت المناسب
          وباستخدام التقنيات الحديثة.
        </Text>
        <Text style={globalstyles.body5}>و يوجد في المكتبة :</Text>
        <Text style={globalstyles.body8}>
          قاعتان للمؤتمرات في المكتبة الرئيسية ومكتبة الحرم الجديد وهي مجهزة
          بأحدث التقنيات لعقد المؤتمرات عن بعد والتواصل مع المؤسسات العلمية
          الآخرى.
        </Text>
        <Text style={globalstyles.body5}>تجهيزات مكتبات جامعة النجاح</Text>
        <Text style={globalstyles.body7}>- ما يزيد عن 265 ألف عنوانا</Text>
        <Text style={globalstyles.body7}>
          - أكثر من 302 ألف كتاباً إلكتروني
        </Text>
        <Text style={globalstyles.body7}>
          -أكثر من 78 ألف مجلة علمية متاحة للاستخدام
        </Text>
        <Text style={globalstyles.body7}>
          - مركز إيداعي لمطبوعات و منشورات البنك الدولي
        </Text>
      </ScrollView>
    </View>
  );
}
export default Home06;
